-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\KY-SNAP-ABAWD-Waivers/Log_Files/ACS_Race_Cleaning.log
  log type:  text
 opened on:  24 Aug 2025, 22:53:56

. 
. /***********************************************
> FILE NAME: ACS_Race_Cleaning
> AUTHOR: Dylan Craig
> DATE CREATED: November 24, 2024
> DATE MODIFIED: November 26, 2024
> 
> PURPOSE: Process and clean ACS county-level race data with selected variables.
> ***********************************************/
. 
. // Echo header into log
. di as txt "***********************************************"
***********************************************

. di as txt "FILE NAME: ACS_Race_Cleaning"
FILE NAME: ACS_Race_Cleaning

. di as txt "AUTHOR: Dylan Craig"
AUTHOR: Dylan Craig

. di as txt "DATE CREATED: November 24, 2024"
DATE CREATED: November 24, 2024

. di as txt "DATE MODIFIED: November 26, 2024"
DATE MODIFIED: November 26, 2024

. di as txt "PURPOSE: Process and clean ACS county-level race data with selected variables."
PURPOSE: Process and clean ACS county-level race data with selected variables.

. di as txt "***********************************************"
***********************************************

. 
. // ------------------------ Step 1: Set Up --------------------------
. local raw_folder "$base_path/Raw_Data/ACS_County_Characteristics_Data/ACS_Race"

. local file_pattern "*.csv"

. 
. // ------------------------ Step 2: Initialize Master Dataset --------
. clear

. tempfile master

. save `master', emptyok replace
(dataset contains 0 observations)
(file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp not found)
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format

. 
. // ------------------------ Step 3: Process Files -------------------
. local files : dir "`raw_folder'" files "`file_pattern'"

. 
. foreach file of local files {
  2.     di "Processing file: `file'"
  3.     local filepath "`raw_folder'/`file'"
  4.     di "Full file path: `filepath'"
  5. 
.     capture import delimited "`filepath'", varnames(1) stringcols(_all) clear
  6.     if _rc {
  7.         di "Error: Could not import `file'. Skipping."
  8.         continue
  9.     }
 10. 
.     // Extract Year from filename
.     gen Year = real(regexs(1)) if regexm("`file'", "([0-9]{4})")
 11.     if missing(Year) {
 12.         di "Error: Could not extract year from `file'. Skipping."
 13.         continue
 14.     }
 15. 
.     append using `master'
 16.     save `master', replace
 17. }
Processing file: acsdt5y2017.b03002-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Race/acsdt5y2017.b03002-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2018.b03002-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Race/acsdt5y2018.b03002-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2019.b03002-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Race/acsdt5y2019.b03002-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2020.b03002-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Race/acsdt5y2020.b03002-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2021.b03002-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Race/acsdt5y2021.b03002-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2022.b03002-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Race/acsdt5y2022.b03002-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format

. 
. // ------------------------ Step 4: Keep Relevant Variables ----------
. use `master', clear

. 
. keep b03002_003e b03002_004e b03002_005e b03002_006e b03002_007e b03002_008e b03002_009e b03002_012e name Year

. 
. rename b03002_003e Ann_NH_White

. rename b03002_004e Ann_NH_Black

. rename b03002_005e Ann_NH_AIAN

. rename b03002_006e Ann_NH_Asian

. rename b03002_007e Ann_NH_NHOPI

. rename b03002_008e Ann_NH_Other

. rename b03002_009e Ann_NH_TwoOrMore

. rename b03002_012e Ann_Hispanic_Latino

. rename name COUNTY

. 
. drop in 1   // Drop ACS header row if present
(1 observation deleted)

. drop if COUNTY == "GEOGRAPHIC AREA NAME"
(0 observations deleted)

. 
. gen COUNTY_clean = upper(subinstr(COUNTY, " County, Kentucky", "", .))

. drop COUNTY

. rename COUNTY_clean COUNTY

. 
. label variable Ann_NH_White         "Annual estimate: Non-Hispanic White population"

. label variable Ann_NH_Black         "Annual estimate: Non-Hispanic Black population"

. label variable Ann_NH_AIAN          "Annual estimate: Non-Hispanic American Indian or Alaska Native population"

. label variable Ann_NH_Asian         "Annual estimate: Non-Hispanic Asian population"

. label variable Ann_NH_NHOPI         "Annual estimate: Non-Hispanic Native Hawaiian or Other Pacific Islander population"
note: label truncated to 80 characters

. label variable Ann_NH_Other         "Annual estimate: Non-Hispanic Other Race population"

. label variable Ann_NH_TwoOrMore     "Annual estimate: Non-Hispanic Two or More Races population"

. label variable Ann_Hispanic_Latino  "Annual estimate: Hispanic or Latino population"

. 
. // ------------------------ Step 5: Add Month Variable ---------------
. gen Month = .
(725 missing values generated)

. expand 12
(7,975 observations created)

. bysort COUNTY Year (Month): replace Month = _n
(8,700 real changes made)

. 
. gen MonthFormatted = string(Month, "%02.0f")

. drop Month

. rename MonthFormatted Month

. 
. order COUNTY Year Month Ann_NH_White Ann_NH_Black Ann_NH_AIAN Ann_NH_Asian Ann_NH_NHOPI Ann_NH_Other Ann_NH_TwoOrMore Ann_Hispanic_Latino

. 
. destring Month, replace
Month: all characters numeric; replaced as byte

. destring Year, replace
Year already numeric; no replace

. destring Ann_Hispanic_Latino, replace
Ann_Hispanic_Latino: contains nonnumeric characters; no replace

. destring Ann_NH_AIAN, replace
Ann_NH_AIAN: contains nonnumeric characters; no replace

. destring Ann_NH_Asian, replace
Ann_NH_Asian: contains nonnumeric characters; no replace

. destring Ann_NH_Black, replace
Ann_NH_Black: contains nonnumeric characters; no replace

. destring Ann_NH_NHOPI, replace
Ann_NH_NHOPI: contains nonnumeric characters; no replace

. destring Ann_NH_TwoOrMore, replace
Ann_NH_TwoOrMore: contains nonnumeric characters; no replace

. destring Ann_NH_White, replace
Ann_NH_White: contains nonnumeric characters; no replace

. destring Ann_NH_Other, replace
Ann_NH_Other: contains nonnumeric characters; no replace

. 
. replace COUNTY = proper(lower(COUNTY))
(8,700 real changes made)

. 
. // ------------------------ Step 6: Save Final Dataset ---------------
. save "$base_path/Data_Outputs/ACS_Race/ACS_Race_Cleaned.dta", replace
file C:\KY-SNAP-ABAWD-Waivers/Data_Outputs/ACS_Race/ACS_Race_Cleaned.dta saved

. di "ACS Race dataset successfully processed and saved."
ACS Race dataset successfully processed and saved.

. 
. // Close log
. log close
      name:  <unnamed>
       log:  C:\KY-SNAP-ABAWD-Waivers/Log_Files/ACS_Race_Cleaning.log
  log type:  text
 closed on:  24 Aug 2025, 22:53:56
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
