-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\KY-SNAP-ABAWD-Waivers/Log_Files/ACS_Poverty_Cleaning.log
  log type:  text
 opened on:  24 Aug 2025, 22:53:55

. 
. /***********************************************
> FILE NAME: ACS_Poverty_Cleaning
> AUTHOR: Dylan Craig
> DATE CREATED: November 24, 2024
> DATE MODIFIED: November 26, 2024
> 
> PURPOSE: Process and clean ACS county-level poverty data with selected variables.
> ***********************************************/
. 
. // Echo header into log
. di as txt "***********************************************"
***********************************************

. di as txt "FILE NAME: ACS_Poverty_Cleaning"
FILE NAME: ACS_Poverty_Cleaning

. di as txt "AUTHOR: Dylan Craig"
AUTHOR: Dylan Craig

. di as txt "DATE CREATED: November 24, 2024"
DATE CREATED: November 24, 2024

. di as txt "DATE MODIFIED: November 26, 2024"
DATE MODIFIED: November 26, 2024

. di as txt "PURPOSE: Process and clean ACS county-level poverty data with selected variables."
PURPOSE: Process and clean ACS county-level poverty data with selected variables.

. di as txt "***********************************************"
***********************************************

. 
. // ------------------------ Step 1: Set Up --------------------------
. local raw_folder "$base_path/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty"

. local file_pattern "*.csv"

. 
. // ------------------------ Step 2: Initialize Master Dataset --------
. clear

. tempfile master

. save `master', emptyok replace
(dataset contains 0 observations)
(file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp not found)
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format

. 
. // ------------------------ Step 3: Process Files -------------------
. local files : dir "`raw_folder'" files "`file_pattern'"

. 
. foreach file of local files {
  2.     di "Processing file: `file'"
  3.     local filepath "`raw_folder'/`file'"
  4.     di "Full file path: `filepath'"
  5. 
.     capture import delimited "`filepath'", varnames(1) stringcols(_all) clear
  6.     if _rc {
  7.         di "Error: Could not import `file'. Skipping."
  8.         continue
  9.     }
 10. 
.     // Extract year from filename
.     gen Year = real(regexs(1)) if regexm("`file'", "([0-9]{4})")
 11.     if missing(Year) {
 12.         di "Error: Could not extract year from `file'. Skipping."
 13.         continue
 14.     }
 15. 
.     append using `master'
 16.     save `master', replace
 17. }
Processing file: acsdt5y2017.b17001-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty/acsdt5y2017.b17001-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2018.b17001-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty/acsdt5y2018.b17001-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2019.b17001-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty/acsdt5y2019.b17001-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2020.b17001-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty/acsdt5y2020.b17001-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2021.b17001-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty/acsdt5y2021.b17001-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format
Processing file: acsdt5y2022.b17001-data.csv
Full file path: C:\KY-SNAP-ABAWD-Waivers/Raw_Data/ACS_County_Characteristics_Data/ACS_Poverty/acsdt5y2022.b17001-data.csv
file C:\Users\dscra\AppData\Local\Temp\ST_e504_000001.tmp saved as .dta format

. 
. // ------------------------ Step 4: Keep Relevant Variables ----------
. use `master', clear

. 
. keep b17001_002e b17001_001e name Year

. rename b17001_002e Ann_Below_Poverty

. rename b17001_001e Ann_Total_Pop

. rename name COUNTY

. 
. gen COUNTY_clean = upper(subinstr(COUNTY, " County, Kentucky", "", .))

. drop COUNTY

. rename COUNTY_clean COUNTY

. 
. // ------------------------ Step 5: Add Month Variable ---------------
. gen Month = .
(726 missing values generated)

. expand 12
(7,986 observations created)

. bysort COUNTY Year (Month): replace Month = _n
(8,712 real changes made)

. 
. gen MonthFormatted = string(Month, "%02.0f")

. drop Month

. rename MonthFormatted Month

. 
. order COUNTY Year Month Ann_Total_Pop Ann_Below_Poverty

. 
. label variable Ann_Total_Pop "Annual total population estimate"

. label variable Ann_Below_Poverty "Annual population below poverty level estimate"

. 
. drop if COUNTY == "GEOGRAPHIC AREA NAME"
(72 observations deleted)

. 
. destring Month, replace
Month: all characters numeric; replaced as byte

. destring Year, replace
Year already numeric; no replace

. destring Ann_Below_Poverty, replace
Ann_Below_Poverty: all characters numeric; replaced as long

. destring Ann_Total_Pop, replace
Ann_Total_Pop: all characters numeric; replaced as long

. 
. replace COUNTY = proper(lower(COUNTY))
(8,640 real changes made)

. 
. // ------------------------ Step 6: Save Final Dataset ---------------
. save "$base_path/Data_Outputs/ACS_Poverty/ACS_Poverty_Cleaned.dta", replace
(file C:\KY-SNAP-ABAWD-Waivers/Data_Outputs/ACS_Poverty/ACS_Poverty_Cleaned.dta not found)
file C:\KY-SNAP-ABAWD-Waivers/Data_Outputs/ACS_Poverty/ACS_Poverty_Cleaned.dta saved

. di "ACS Poverty dataset successfully processed and saved."
ACS Poverty dataset successfully processed and saved.

. 
. // Close log
. log close
      name:  <unnamed>
       log:  C:\KY-SNAP-ABAWD-Waivers/Log_Files/ACS_Poverty_Cleaning.log
  log type:  text
 closed on:  24 Aug 2025, 22:53:55
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
